app/views/registrants/show.html.erb

SELECT  "details".* FROM "details" WHERE "details"."registrant_id" = $1 LIMIT $2  [["registrant_id", 22], ["LIMIT", 1]]
---
  <strong>First Name:</strong>
  <%= @registrant.detail.first_name %>