app/views/domains/index.html.erb

        <td><%= domain.expiration_date %></td>
        <td><%= domain.user.first_name %></td>
        <td><%= link_to "#{domain.registrant.handle}", registrant_path(domain.registrant) %></td>
        <td><%= domain.order.id %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]