app/views/domains/result.html.erb

        <td><%= domain.expiration_date %></td>
        <td><%= domain.user.first_name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]