app/views/domains/show.html.erb

  <strong>Owner:</strong>
  <%= @domain.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]