app/controllers/domains_controller.rb

  def index
    @domains = Domain.all
---
SELECT "domains".* FROM "domains"

  def create
    # create registrant -> create order -> create domain
    @order = Order.create(user_id:current_user.id)
    @order.save

    if @order.save
      puts "order created with id #{@order.id}"
    else
      puts 'order creation failed'
    end

    @domain = current_user.domains.new(domain_params)

    @domain.user_id = current_user.id
    @domain.registrant_id = Registrant.last.id
    @domain.order_id = @order.id

    # create an order first
    respond_to do |format|
      if @domain.save
---
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-06-26 03:35:24.676659"], ["updated_at", "2020-06-26 03:35:24.676659"]]
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-06-26 03:23:46.197336"], ["updated_at", "2020-06-26 03:23:46.197336"]]
SELECT  "registrants".* FROM "registrants" ORDER BY "registrants"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "domains" ("domain_name", "period", "registration_date", "expiration_date", "created_at", "updated_at", "registrant_id", "user_id", "order_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @domain.update(domain_params)
---
UPDATE "domains" SET "domain_name" = $1, "period" = $2, "registration_date" = $3, "expiration_date" = $4, "updated_at" = $5 WHERE "domains"."id" = $6  [["domain_name", "fb.com"], ["period", "3 months"], ["registration_date", "2020-06-25 01:29:00"], ["expiration_date", "2020-06-25 01:29:00"], ["updated_at", "2020-06-25 01:29:15.387876"], ["id", 1]]

  def destroy
    @domain.destroy
---
DELETE FROM "domains" WHERE "domains"."id" = $1  [["id", 4]]

  def result
    @renew_flag = false
    @available_flag = false

    if current_user.domains.search(params[:search]) != nil #there are domains available for renewal for current user
      @domains = current_user.domains.search(params[:search]) #return domains of user
      @renew_flag = true
    else #no registered domains under current user, check in epp if available
          @domains = Domain.search(params[:search])
---
SELECT "domains".* FROM "domains" WHERE "domains"."user_id" = $1 AND "domains"."id" = $2  [["user_id", 1], ["id", 1]]
SELECT "domains".* FROM "domains" WHERE "domains"."user_id" = $1 AND "domains"."id" = $2  [["user_id", 1], ["id", 4]]

    def set_domain
      @domain = Domain.find(params[:id])
---
SELECT  "domains".* FROM "domains" WHERE "domains"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]