app/controllers/domains_controller.rb

INSERT INTO "domains" ("domain_name", "period", "registration_date", "expiration_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @domain = Domain.new(domain_params)

    respond_to do |format|
      if @domain.save

UPDATE "domains" SET "domain_name" = $1, "period" = $2, "registration_date" = $3, "expiration_date" = $4, "updated_at" = $5 WHERE "domains"."id" = $6  [["domain_name", "fb.com"], ["period", "3 months"], ["registration_date", "2020-06-25 01:29:00"], ["expiration_date", "2020-06-25 01:29:00"], ["updated_at", "2020-06-25 01:29:15.387876"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @domain.update(domain_params)

DELETE FROM "domains" WHERE "domains"."id" = $1  [["id", 1]]
---
  def destroy
    @domain.destroy

SELECT  "domains".* FROM "domains" WHERE "domains"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_domain
      @domain = Domain.find(params[:id])