app/controllers/payments_controller.rb

  def execute
    # Implement payment execution
    payment_id = params[:payment_id]
    payer_id   = params[:payer_id]
    domain_name = params[:domain_name]
    period = params[:period]

    payment = Payment.find(payment_id)

    if payment.execute( :payer_id => payer_id )
      # Success Message
      # Note that you'll need to `Payment.find` the payment again to access user info like shipping address
      # Place domain registration code here (and epp)


      domain = current_user.domains.new(
        domain_name: domain_name,
        period: period,
        registration_date: '05/20/2000',
        expiration_date: '06/12/2001',
      )
      domain.save
---
INSERT INTO "domains" ("domain_name", "period", "expiration_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"