app/controllers/registrants_controller.rb

  def create
    @registrant = Registrant.new(registrant_params)
    @build_detail_temp = @registrant.build_detail(registrant_params[:detail_attributes])

    # raise @reg_temp.inspect

    respond_to do |format|
      if @registrant.save
---
INSERT INTO "details" ("created_at", "updated_at", "registrant_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-06-26 06:05:05.191991"], ["updated_at", "2020-06-26 06:05:05.191991"], ["registrant_id", 16]]
INSERT INTO "registrants" ("created_at", "updated_at", "contact_handle") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-06-26 02:11:11.150479"], ["updated_at", "2020-06-26 02:11:11.150479"], ["contact_handle", "handle1"]]

    def set_registrant
      @registrant = Registrant.find(params[:id])
---
SELECT  "registrants".* FROM "registrants" WHERE "registrants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]