app/controllers/registrants_controller.rb

  def index
    @registrants = Registrant.all
---
SELECT "registrants".* FROM "registrants"

  def create
    @timestamp = '%10.6f' % Time.now.to_f
    @handle = @timestamp.sub('.', '')

    @registrant = Registrant.new(registrant_params)
    @build_detail_temp = @registrant.build_detail(registrant_params[:detail_attributes])

    @registrant.handle = 'somehandle'

    # raise @reg_temp.inspect
    @order = Order.create(user_id:current_user.id)
        @order.save

    # @domain = current_user.domains.new(domain_params)
    @build_domain_temp = @registrant.build_domain(registrant_params[:domain_attributes])

    @build_domain_temp.user_id = current_user.id
    @build_domain_temp.registrant_id = @registrant.id
    @build_domain_temp.order_id = @order.id

    respond_to do |format|
      if @registrant.save
---
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-06-26 07:53:56.188567"], ["updated_at", "2020-06-26 07:53:56.188567"]]
INSERT INTO "details" ("first_name", "last_name", "organization", "contact_number", "address", "created_at", "updated_at", "registrant_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "domains" ("domain_name", "period", "registration_date", "expiration_date", "created_at", "updated_at", "registrant_id", "user_id", "order_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "registrants" ("created_at", "updated_at", "handle") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-06-26 07:54:14.912062"], ["updated_at", "2020-06-26 07:54:14.912062"], ["handle", "somehandle"]]

  def destroy
    @registrant.destroy
---
DELETE FROM "registrants" WHERE "registrants"."id" = $1  [["id", 1]]

    def set_registrant
      @registrant = Registrant.find(params[:id])
---
SELECT  "registrants".* FROM "registrants" WHERE "registrants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]