app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "address" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "Matthew"], ["last_name", "Rocafort"], ["address", "Pedro Gil"], ["updated_at", "2020-06-25 01:48:16.707480"], ["id", 1]]