app/models/domain.rb

	def self.search(search)
		#search is the domain name
		if search #if there is an input
			domain = Domain.find_by(domain_name: search)
---
SELECT  "domains".* FROM "domains" WHERE "domains"."domain_name" = $1 LIMIT $2  [["domain_name", "sad"], ["LIMIT", 1]]